In [2]:
#1
import pandas as pd

In [3]:
#2

pd.__version__

'1.5.3'

In [5]:
#3

pd.show_versions(True)

{
  "system": {
    "commit": "2e218d10984e9919f0296931d92ea851c6a6faf5",
    "python": "3.9.12.final.0",
    "python-bits": 64,
    "OS": "Darwin",
    "OS-release": "21.6.0",
    "Version": "Darwin Kernel Version 21.6.0: Sun Nov  6 23:31:16 PST 2022; root:xnu-8020.240.14~1/RELEASE_X86_64",
    "machine": "x86_64",
    "processor": "i386",
    "byteorder": "little",
    "LC_ALL": null,
    "LANG": null,
    "LOCALE": {
      "language-code": null,
      "encoding": "UTF-8"
    }
  },
  "dependencies": {
    "pandas": "1.5.3",
    "numpy": "1.23.5",
    "pytz": "2022.7",
    "dateutil": "2.8.2",
    "setuptools": "61.2.0",
    "pip": "23.0.1",
    "Cython": null,
    "pytest": null,
    "hypothesis": null,
    "sphinx": null,
    "blosc": null,
    "feather": null,
    "xlsxwriter": null,
    "lxml.etree": null,
    "html5lib": null,
    "pymysql": null,
    "psycopg2": null,
    "jinja2": "3.1.2",
    "IPython": "8.6.0",
    "pandas_datareader": null,
    "bs4": "4.11.1",
    "bottleneck": "1.3.5",
    "brotli": "",
    "fastparquet": null,
    "fsspec": null,
    "gcsfs": null,
    "matplotlib": "3.6.2",
    "numba": null,
    "numexpr": "2.8.4",
    "odfpy": null,
    "openpyxl": null,
    "pandas_gbq": null,
    "pyarrow": null,
    "pyreadstat": null,
    "pyxlsb": null,
    "s3fs": null,
    "scipy": null,
    "snappy": null,
    "sqlalchemy": null,
    "tables": null,
    "tabulate": null,
    "xarray": null,
    "xlrd": null,
    "xlwt": null,
    "zstandard": null,
    "tzdata": "2023.3"
  }
}

In [6]:
import numpy as np

data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [7]:
#4

df = pd.DataFrame(data, index=labels)

In [8]:
#5

df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [9]:
df.describe()

            age     visits
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

In [10]:
#6
df.iloc[:3]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [11]:
df.head(3)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [12]:
#7

df.loc[:, ['animal', 'age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

In [13]:
df[['animal', 'age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

In [14]:
#8

df.loc[df.index[[3, 4, 8]], ['animal', 'age']]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

In [15]:
#9

df[df['visits'] > 3]

Empty DataFrame
Columns: [animal, age, visits, priority]
Index: []

In [16]:
#10

df[df['age'].isnull()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

In [17]:
#11

df[(df['animal']=='cat') & (df['age']<3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

In [18]:
#12

df[df['age'].between(2, 4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

In [19]:
#13

df.loc[['f'], ['age']] = 1.5

In [20]:
#14

df['visits'].sum()

19

In [21]:
#15

df.groupby('animal')['age'].mean()

animal
cat      2.333333
dog      5.000000
snake    2.500000
Name: age, dtype: float64

In [22]:
#16

df.loc['k'] = ['tiger', 5,  0, 'yes']
print(df)
df.drop('k')

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no
k  tiger  5.0       0      yes

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [23]:
#17

df['animal'].value_counts()

cat      4
dog      4
snake    2
tiger    1
Name: animal, dtype: int64

In [24]:
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no
k  tiger  5.0       0      yes

In [25]:
#18
df

df.sort_values(['age', 'visits'], ascending=[False, True])

  animal  age  visits priority
i    dog  7.0       2       no
k  tiger  5.0       0      yes
e    dog  5.0       2       no
g  snake  4.5       1       no
j    dog  3.0       1       no
b    cat  3.0       3      yes
a    cat  2.5       1      yes
f    cat  1.5       3       no
c  snake  0.5       2       no
h    cat  NaN       1      yes
d    dog  NaN       3      yes

In [26]:
#19

df['priority'] = df['priority'].apply(lambda x: x == 'yes')
#df['priority'] = df['priority'].map({'yes': True, 'no': False})

In [27]:
#20
df['animal'] = df['animal'].replace('snake', 'python')

In [28]:
#21
pd.pivot_table(df, values='age', index='animal', columns='visits', aggfunc='mean')

visits    0    1    2     3
animal
cat     NaN  2.5  NaN  2.25
dog     NaN  3.0  6.0   NaN
python  NaN  4.5  0.5   NaN
tiger   5.0  NaN  NaN   NaN

In [29]:
#22

df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})


df.loc[df['A'].shift() != df['A']]

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

In [30]:
#23

df = pd.DataFrame(np.random.random(size=(5, 3)))
df.sub(df.mean(axis=1), axis=0)

          0         1         2
0 -0.198093 -0.127185  0.325278
1 -0.071045 -0.190083  0.261129
2  0.059101 -0.252090  0.192989
3  0.012422  0.257756 -0.270178
4 -0.022293  0.094195 -0.071903

In [31]:
#24

df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
print(df)
print(df.sum(axis=0).idxmin())
print(df.sum(axis=0).min())

          a         b         c         d         e         f         g  \
0  0.139149  0.644780  0.931692  0.095557  0.321613  0.973175  0.003134
1  0.737023  0.797835  0.026221  0.219374  0.650207  0.848042  0.009005
2  0.782402  0.440421  0.460378  0.104670  0.356273  0.759539  0.004934
3  0.615050  0.193010  0.589664  0.542163  0.299292  0.521322  0.894792
4  0.964672  0.041581  0.657426  0.513552  0.681509  0.204564  0.854665

          h         i         j
0  0.806224  0.184340  0.356527
1  0.028705  0.440640  0.685809
2  0.017840  0.697714  0.758851
3  0.943179  0.873918  0.776547
4  0.079551  0.436986  0.288935
d
1.475316774728988

In [32]:
#25
df = pd.DataFrame(np.random.randint(-1, 2, (5, 2)), columns=list('ab'))
len(df.drop_duplicates())

5

In [33]:
#26
nan = np.nan

data = [[0.04,  nan,  nan, 0.25,  nan, 0.43, 0.71, 0.51,  nan,  nan],
        [ nan,  nan,  nan, 0.04, 0.76,  nan,  nan, 0.67, 0.76, 0.16],
        [ nan,  nan, 0.5 ,  nan, 0.31, 0.4 ,  nan,  nan, 0.24, 0.01],
        [0.49,  nan,  nan, 0.62, 0.73, 0.26, 0.85,  nan,  nan,  nan],
        [ nan,  nan, 0.41,  nan, 0.05,  nan, 0.61,  nan, 0.48, 0.68]]

columns = list('abcdefghij')

df = pd.DataFrame(data, columns=columns)

(df.isnull().cumsum(axis=1) == 3).idxmax(axis=1)

0    e
1    c
2    d
3    h
4    d
dtype: object

In [34]:
#27

df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})

df.groupby('grps').aggregate(lambda x: sum(sorted(x, reverse=True)[:3]))
# df.groupby('grps')['vals'].nlargest(3).sum(level=0)

      vals
grps
a      409
b      156
c      345

In [35]:
#28

df = pd.DataFrame(np.random.randint(1, 101, (50, 2)), columns=['A', 'B'])
df.groupby(pd.cut(df['A'], np.arange(0, 101, 10)))['B'].sum()
# pd.cut(df['A'], np.arange(0, 101, 25))

A
(0, 10]      248
(10, 20]     139
(20, 30]     209
(30, 40]     295
(40, 50]     217
(50, 60]      52
(60, 70]     382
(70, 80]      99
(80, 90]     306
(90, 100]    283
Name: B, dtype: int64

In [36]:
#29
df = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]})
izero = np.r_[-1, (df == 0).values.nonzero()[0]]
idx = np.arange(len(df))
y = df['X'] != 0
df['Y'] = idx - izero[np.searchsorted(izero - 1, idx) - 1]
df

   X  Y
0  7  1
1  2  2
2  0  0
3  3  1
4  4  2
5  2  3
6  5  4
7  0  0
8  3  1
9  4  2

In [50]:
#30

df = pd.DataFrame(np.random.RandomState(30).randint(1, 101, size=(8, 8)))
df.unstack().sort_values()[-3:].index.to_list()

[(5, 7), (6, 4), (2, 5)]

In [65]:
#31
df = pd.DataFrame({"vals": np.random.RandomState(31).randint(-30, 30, size=15), 
                   "grps": np.random.RandomState(31).choice(["A", "B"], 15)})

def replace(group):
    mask = group<0
    group[mask] = group[~mask].mean()
    return group

df['patched_values'] = df.groupby(['grps'])['vals'].transform(replace)
print(df)

    vals grps  patched_values
0    -12    A            13.6
1     -7    B            28.0
2    -14    A            13.6
3      4    A             4.0
4     -7    A            13.6
5     28    B            28.0
6     -2    A            13.6
7     -1    A            13.6
8      8    A             8.0
9     -2    B            28.0
10    28    A            28.0
11    12    A            12.0
12    16    A            16.0
13   -24    A            13.6
14   -12    A            13.6

In [79]:
#32
df = pd.DataFrame({'group': list('aabbabbbabab'),
                   'value': [1, 2, 3, np.nan, 2, 3, np.nan, 1, 7, 3, np.nan, 8]})

g1 = df.groupby(['group'])['value']              # group values  

g2 = df.fillna(0).groupby(['group'])['value']    # fillna, then group values

s = g2.rolling(3, min_periods=1).sum() / g1.rolling(3, min_periods=1).count() # compute means
s
s.reset_index(level=0, drop=True).sort_index()  # drop/sort index

0     1.000000
1     1.500000
2     3.000000
3     3.000000
4     1.666667
5     3.000000
6     3.000000
7     2.000000
8     3.666667
9     2.000000
10    4.500000
11    4.000000
Name: value, dtype: float64

In [96]:
#33

dt = pd.date_range(start='2015-01-01', end='2016-01-01', inclusive='left', freq='B')
ser = pd.Series(np.random.randint(0, 100, len(dt)), index=dt)

In [97]:
#34
ser[ser.index.weekday == 2].sum()

2556

In [100]:
#35
ser.resample('M').mean()

2015-01-31    48.454545
2015-02-28    60.300000
2015-03-31    51.318182
2015-04-30    44.909091
2015-05-31    49.047619
2015-06-30    54.772727
2015-07-31    47.608696
2015-08-31    46.761905
2015-09-30    53.363636
2015-10-31    40.545455
2015-11-30    58.619048
2015-12-31    48.521739
Freq: M, dtype: float64

In [102]:
ser.groupby(pd.Grouper(freq='4M')).idxmax()

2015-01-31   2015-01-23
2015-05-31   2015-02-23
2015-09-30   2015-08-27
2016-01-31   2015-12-10
Freq: 4M, dtype: datetime64[ns]

In [103]:
pd.date_range('2015-01-01', '2016-12-31', freq='WOM-3THU')

DatetimeIndex(['2015-01-15', '2015-02-19', '2015-03-19', '2015-04-16',
               '2015-05-21', '2015-06-18', '2015-07-16', '2015-08-20',
               '2015-09-17', '2015-10-15', '2015-11-19', '2015-12-17',
               '2016-01-21', '2016-02-18', '2016-03-17', '2016-04-21',
               '2016-05-19', '2016-06-16', '2016-07-21', '2016-08-18',
               '2016-09-15', '2016-10-20', '2016-11-17', '2016-12-15'],
              dtype='datetime64[ns]', freq='WOM-3THU')